RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
For the generation of a divided clock, the integer division range is restricted to [2, 16,777,216 31/32].
 
For the generation of a 50/50 percent duty cycle divided clock, the  division range is restricted to [2, 16,777,216].
 
Note that this field is retained. However, the counter that is used to implement the division is not and will be initialized by HW to '0' when transitioning from DeepSleep to Active power mode.</description>
                <bitRange>[31:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPUSS</name>
      <description>CPU subsystem (CPUSS)</description>
      <baseAddress>0x40200000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>NvicMux0</name>
        <description>CPU User Interrupt #0</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>NvicMux1</name>
        <description>CPU User Interrupt #1</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>NvicMux2</name>
        <description>CPU User Interrupt #2</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>NvicMux3</name>
        <description>CPU User Interrupt #3</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>NvicMux4</name>
        <description>CPU User Interrupt #4</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>NvicMux5</name>
        <description>CPU User Interrupt #5</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>NvicMux6</name>
        <description>CPU User Interrupt #6</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>NvicMux7</name>
        <description>CPU User Interrupt #7</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>Internal0</name>
        <description>Internal SW Interrupt #0</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>Internal1</name>
        <description>Internal SW Interrupt #1</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>Internal2</name>
        <description>Internal SW Interrupt #2</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>Internal3</name>
        <description>Internal SW Interrupt #3</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>Internal4</name>
        <description>Internal SW Interrupt #4</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>Internal5</name>
        <description>Internal SW Interrupt #5</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>Internal6</name>
        <description>Internal SW Interrupt #6</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>Internal7</name>
        <description>Internal SW Interrupt #7</description>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <name>IDENTITY</name>
          <description>Identity</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>P</name>
              <description>This field specifies the privileged setting ('0': user mode; '1': privileged mode) of the transfer that reads the register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NS</name>
              <description>This field specifies the security setting ('0': secure mode; '1': non-secure mode) of the transfer that reads the register.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>This field specifies the protection context of the transfer that reads the register.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MS</name>
              <description>This field specifies the bus master identifier of the transfer that reads the register.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM7_0_STATUS</name>
          <description>CM7 0 status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x13</resetValue>
          <resetMask>0x1E13</resetMask>
          <fields>
            <field>
              <name>SLEEPING</name>
              <description>Specifies if the CPU is in Active, Sleep or DeepSleep power mode:
- Active power mode: SLEEPING is '0'.
- Sleep power mode: SLEEPING is '1' and SLEEPDEEP is '0'.
- DeepSleep power mode: SLEEPING is '1' and SLEEPDEEP is '1'.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Specifies if the CPU is in Sleep or DeepSleep power mode. See SLEEPING field.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_DONE</name>
              <description>After a PWR_MODE change this flag indicates if the new power mode has taken effect or not. 
Note: this flag can also change as a result of  a change in debug power up req</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCMC_CM7_1_MS</name>
              <description>Outstanding transactions from CM7 1.
'0': There are no outstanding transactions to the CM7 I/D-TCM slave port (AHBS) from CM7 1.
'1': There are outstanding transactions to the CM7 I/D-TCM slave port (AHBS) from CM7 1. Do not switch the CM7 power off.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCMC_EXT_MS_2_TO_0</name>
              <description>Outstanding transactions from external AXI masters 2 to 0.
'0': There are no outstanding transactions to the CM7 I/D-TCM slave port (AHBS) from external AXI masters 2 to 0.
'1': There are outstanding transactions to the CM7 I/D-TCM slave port (AHBS) from external AXI masters 2 to 0. Do not switch the CM7 power off.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCMC_EXT_MS_3</name>
              <description>Outstanding transactions from external AXI master 3.
'0': There are no outstanding transactions to the CM7 I/D-TCM slave port (AHBS) from external AXI master 3.
'1': There are outstanding transactions to the CM7 I/D-TCM slave port (AHBS) from external AXI master 3. Do not switch the CM7 power off.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCMC_AHB_MS</name>
              <description>Ongoing AHB transaction.
'0': There is no ongoing transaction to the CM7 I/D-TCM slave port (AHBS) from an AHB master.
'1': There is an ongoing transaction to the CM7 I/D-TCM slave port (AHBS) from an AHB master. Do not switch the CM7 power off.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAST_0_CLOCK_CTL</name>
          <description>Fast 0 clock control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF8</resetMask>
          <fields>
            <field>
              <name>FRAC_DIV</name>
              <description>Fractional division by (FRAC_DIV/32). Allows for fractional divisions in the range [0, 31/32]. Note that fractional division results in clock jitter as some clock periods may be 1 'clk_hf&lt;x&gt;' cycle longer than other clock periods.</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_DIV</name>
              <description>Integer division by (1+INT_DIV). Allows for integer divisions in the range [1, 256] (INT_DIV is in the range [0, 255]).</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM7_0_CTL</name>
          <description>CM7 0 control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x9FFF0F1F</resetMask>
          <fields>
            <field>
              <name>PPB_LOCK</name>
              <description>Write disable for specific CPU registers:
Bit 0: ITCMR register. '0': enabled; '1': disabled.
Bit 1: DTCMR register. '0': enabled; '1': disabled.
Bit 2: AHBPCR register. '0': enabled; '1': disabled.
Bit 3: VTOR register. '0': enabled; '1': disabled.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_WAIT</name>
              <description>When this signal is '1' out of reset, it forces the CPU into a quiescent state that delays its boot-up sequence and instruction execution until this signal is driven '0'. This allows the TCMs to be loaded by the system before the CPU performs any TCM accesses. The CPU AHBS interface functions while CPU_WAIT is '1' and services transactions initiated by the system (e.g. DMA controller) to load the TCMs.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_TCM_EN</name>
              <description>TCM enable initialization after reset:
Bit 0: ITCM. '0': disabled; '1': enabled.
Bit 1: DTCM. '0': disabled; '1': enabled.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INIT_RMW_EN</name>
              <description>TCM read-modify-write enable initialization after reset:
Bit 0: ITCM. '0': disabled; '1': enabled.
Bit 1: DTCM. '0': disabled; '1': enabled.

