RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
        <register>
          <name>CM7_1_STATUS</name>
          <description>CM7 #1 interface status</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>MAIN_INTERNAL_ERR</name>
              <description>Specifies/registers the occurrence of a FLASH macro main interface internal error (typically the result of a read access while a program erase operation is ongoing) as a result of a CM7_1 (or debug access via SYS_AP/CM7_1_AP) access. 

SW clears this field to '0'. HW sets this field to '1' on a FLASH macro main interface internal error. Typically, SW reads this field after a code section to detect the occurrence of an error.

Note: this field is independent of FLASH_CTL.MAIN_ERR_SILENT.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WORK_INTERNAL_ERR</name>
              <description>See CM7_1_STATUS.MAIN_INTERNAL_ERROR.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTO_BUFF_CTL</name>
          <description>Cryptography buffer control</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>PREF_EN</name>
              <description>Prefetch enable:
0: Disabled.
1: Enabled.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DW0_BUFF_CTL</name>
          <description>Datawire 0 buffer control</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>PREF_EN</name>
              <description>See CRYPTO_BUFF_CTL.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DW1_BUFF_CTL</name>
          <description>Datawire 1 buffer control</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>PREF_EN</name>
              <description>See CRYPTO_BUFF_CTL.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAC_BUFF_CTL</name>
          <description>DMA controller buffer control</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>PREF_EN</name>
              <description>See CRYPTO_BUFF_CTL.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOW0_MS_BUFF_CTL</name>
          <description>Slow external master 0 buffer control</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>PREF_EN</name>
              <description>See CRYPTO_BUFF_CTL.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOW1_MS_BUFF_CTL</name>
          <description>Slow external master 1 buffer control</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0x40000000</resetMask>
          <fields>
            <field>
              <name>PREF_EN</name>
              <description>See CRYPTO_BUFF_CTL.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>FM_CTL_ECT</name>
          <description>Flash Macro Registers</description>
          <addressOffset>0x0000F000</addressOffset>
          <register>
            <name>FM_CTL</name>
            <description>Flash Macro Control</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x8000001F</resetMask>
            <fields>
              <field>
                <name>FM_MODE</name>
                <description>Flash macro mode selection:
d0: Read/Idle - Normal mode, read array enabled
d1: Not Used - the 1st analog POR is done by enable/enable_hv
d2 - POR FUR Download - Downloads critical Flash initialization data from OTP (BG, rd, redu, etc....)
d3 - POR IRAM MMR Download - Downloads from OTP region the MMR / IRAM into to the 8051 RDL shadows
d4 - POR SW Download - Downloads from OTP region the SW code into to the 8051 MCU SRAM 
d5 - POR Code_Work Prepare - Loads the Code and Work Flash MG's to be ready for user mode operation
d6 - Not Used
d7 - Program 32b (WORK) - Used as program confirm command for  32 (Work) bits program
d8 - Program 64b (CODE) - Used as program confirm command for  64 (Code) bits program
d9 - Program 256b (CODE) - Used as program confirm command for  256 (Code) bits program
d10: Program Page (CODE) - Used as program confirm command for page program for Code flash
d11: Not Used
d12 - Sector Erase - Erase for all kinds of sectors (Code/Work/SMS)
d13 - Blank check Entry (UBC)
d14 - Blank Check Read 32bit (WORK) - Blank check mode
d15 - Blank check Exit
d16 - Not Used
d17 - Erase Suspend - Suspend command to the Erase operation
d18 - Erase Resume - Resume command to Erase suspended operation
d19 - Not Used
d20- Not Used
d21- Not Used
d22- Not Used
d23- Not Used
d24- Not Used
d25- Not Used
d26- Not Used
d27- Not Used
d28- Not Used
d29- Not Used
d30: Not Used
d31: Not Used</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EMB_START</name>
                <description>'0': not active
'1': starts the actual embedded operation</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FM_CODE_MARGIN</name>
            <description>Flash Macro Margin Mode on Code Flash</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3943</resetValue>
            <resetMask>0xE000FFFF</resetMask>
            <fields>
              <field>
                <name>MARGIN_DCS_TRIM</name>
                <description>see above table to set the DCS reference current value to be used during Margin mode. (default set to 5uS = 0x143) which gives a Margin to the Erase side. 7uA would probably be used for Margin to the PGM side</description>
                <bitRange>[8:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MARGIN_DCS_TRIM_EN</name>
                <description>0:  internal device defaults used from Margin reads reference current
1:  MARGIN_DCS_TRIM configuration is used during Margin read</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MARGIN_RDREG_TRIM</name>
                <description>rdreg_c trim to be used in Margin mode if enabled by MARGIN_MODE_RDREG_CHNG_EN</description>
                <bitRange>[15:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MARGIN_PGM_ERS_B</name>
                <description>0: ERS Margin is checked
1: PGM Margin is checked</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MARGIN_MODE_RDREG_CHNG_EN</name>
                <description>when set will also use the MARGIN_RDREG_TRIM from above. Default is not to use</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MARGIN_MODE_EN</name>
                <description>when set puts the s40ect Flash IP In Margin mode</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FM_ADDR</name>
            <description>Flash Macro Address</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FM_ADDR</name>
                <description>Code or Work Flash Address to be used during write operations (PGM/ERS)</description>
                <bitRange>[31:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>Interrupt</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>INTR</name>
                <description>Set to '1', when event is detected. Write INTR field with '1', to clear bit. Write INTR_SET field with '1', to set bit.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>Interrupt Set</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>INTR_SET</name>
                <description>Write INTR_SET field with '1' to set corresponding INTR field (a write of '0' has no effect).</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>Interrupt Mask</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>INTR_MASK</name>
                <description>Mask for corresponding field in the INTR register</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>Interrupt Masked</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>INTR_MASKED</name>
                <description>Logical and of corresponding request and mask fields.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ECC_OVERRIDE</name>
            <description>ECC Data In override information and control bits</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xC00000FF</resetMask>
            <fields>
              <field>
                <name>ECC_OVERRIDE_SYNDROME</name>
                <description>The override syndrome itself to be used in case one of the enables are set. It will take [7:0] in the case of Code flash and [6:0] in the case of work flash, to bypass the internal generated syndrome</description>
                <bitRange>[7:0]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>ECC_OVERRIDE_WORK</name>
                <description>0: no override. Using internal ECC engine to calculate the ECC of the Work Flash</description>
                <bitRange>[30:30]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>ECC_OVERRIDE_CODE</name>
                <description>0: no override. Using internal ECC engine to calculate the ECC of the Code Flash</description>
                <bitRange>[31:31]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FM_DATA</name>
            <description>Flash macro data_in[31 to 0] both Code and Work Flash</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FM_DATA</name>
                <description>Pgm command data in going to the internal write buffer (WBUF).</description>
                <bitRange>[31:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>BOOKMARK</name>
            <description>Bookmark register - keeps the current FW HV seq</description>
            <addressOffset>0x64</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BOOKMARK</name>
                <description>Used by FW. Keeps the Current HV cycle sequence</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MAIN_FLASH_SAFETY</name>
            <description>Main (Code) Flash Security enable</description>
            <addressOffset>0x400</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>MAINFLASHWRITEENABLE</name>
                <description>'0': Main Flash embedded operations are blocked
'1': Main Flash embedded operations are enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status read from Flash Macro</description>
            <addressOffset>0x404</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x80000000</resetValue>
            <resetMask>0xF800007F</resetMask>
            <fields>
              <field>
                <name>PGM_CODE</name>
                <description>Indicates if active PGM operation to the Code flash is taking place
0: not running
1: running</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PGM_WORK</name>
                <description>Indicates if active PGM operation to the Work flash is taking place
0: not running
1: running</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ERASE_CODE</name>
                <description>Indicates if active Erase operation to the Code flash is taking place
0: not running
1: running</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ERASE_WORK</name>
                <description>Indicates if active Erase operation to the Work flash is taking place
0: not running
1: running</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>ERS_SUSPEND</name>
                <description>Indicates if Erase operation (Code/Work) is currently being suspended
0: not suspended
1: suspended</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BLANK_CHECK_WORK</name>
                <description>Indicates if Blank Check mode is currently running on the work flash
0: not running
1: running</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BLANK_CHCEK_PASS</name>
                <description>Indicates  the Blank check command result is PASS (Blank)
0: Not Blank
1: Blank (PASS)</description>
                <bitRange>[6:6]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>POR_1B_ECC_CORRECTED</name>
                <description>Indicates internal ECC found 1b error while downloading info in POR from NVM to VM and fixed it. 
Valid after 2nd, 3rd and 4th POR phases (FUR, IREM &amp; MMR, SW DOWNLOAD). If Set it is not cleaned till additional POR (rst_hf_ac_t)
0: No error
1: 1b ECC Error corrected in POR</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>POR_2B_ECC_ERROR</name>
                <description>Indicates an internal ECC error of 2b while downloading info in POR from NVM to VM. 
Valid after 2nd, 3rd and 4th POR phases (FUR, IREM &amp; MMR, SW DOWNLOAD). If Set it is not cleaned till additional POR (rst_hf_ac_t)
0: No error
1: ECC 2b Error in POR</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>NATIVE_POR</name>
                <description>Indicates a Native Flash state (UV) or sorted one.
Valid only after 2nd phase of POR (FUR DOWNLOAD). 
Comment: not a retained flop, therefore reset (rst_hf_act_n) puts it back to 0. If Set it is not cleaned till additional POR (rst_hf_ac_t)
0: SORTED DEVICE (Non - Native)
1: NATIVE</description>
                <bitRange>[29:29]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HANG</name>
                <description>After embedded operation (pgm/erase) this flag will tell if it was successful or failed
0: PASS
1: FAIL</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUSY</name>
                <description>Whenever the device is in embedded mode the RDY goes low. Should be the same as c_interrupt pin of the IP (but inverted)
1: busy in embedded
0: rdy (high also in erase suspend)</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WORK_FLASH_SAFETY</name>
            <description>Work Flash Security enable</description>
            <addressOffset>0x500</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>WORKFLASHWRITEENABLE</name>
                <description>0: Work Flash embedded operations are blocked
1: Work Flash embedded operations are enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
