RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
          <register>
            <name>CQISE</name>
            <description>Command Queuing Interrupt Status Enable register</description>
            <addressOffset>0x194</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>HAC_STE</name>
                <description>Halt complete interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.HAC is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.HAC is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCC_STE</name>
                <description>Task complete interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.TCC is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.TCC is disabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RED_STE</name>
                <description>Response error detected interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.RED is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.RED is disabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCL_STE</name>
                <description>Task cleared interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.TCL is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.TCL is disabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCE_STE</name>
                <description>General Crypto Error interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.GCE is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.GCE is disabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICCE_STE</name>
                <description>Invalid Crypto Configuration Error interrupt status enable
Values:
- 0x1 (INT_STS_ENABLE): CQIS.ICCE is set when its
interrupt condition is active
- 0x0 (INT_STS_DISABLE): CQIS.ICCE is disabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQISGE</name>
            <description>Command Queuing Interrupt signal enable register</description>
            <addressOffset>0x198</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F</resetMask>
            <fields>
              <field>
                <name>HAC_SGE</name>
                <description>Halt complete interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.HAC interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.HAC interrupt signal
generation is disabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCC_SGE</name>
                <description>Task complete interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.TCC interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.TCC interrupt signal
generation is disabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RED_SGE</name>
                <description>Response error detected interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.RED interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.RED interrupt signal
generation is disabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TCL_SGE</name>
                <description>Task cleared interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.TCL interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.TCL interrupt signal
generation is disabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GCE_SGE</name>
                <description>General Crypto Error interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.GCE interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.GCE interrupt signal
generation is disabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ICCE_SGE</name>
                <description>Invalid Crypto Configuration Error interrupt signal enable
Values:
- 0x1 (INT_SIG_ENABLE): CQIS.ICCE interrupt signal
generation is active
- 0x0 (INT_SIG_DISABLE): CQIS.ICCE interrupt signal
generation is disabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQIC</name>
            <description>Command Queuing Interrupt Coalescing register</description>
            <addressOffset>0x19C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x80119FFF</resetMask>
            <fields>
              <field>
                <name>TOUT_VAL</name>
                <description>Interrupt Coalescing Timeout Value
Software uses this field to configure the maximum time
allowed between the completion of a task on the bus and the
generation of an interrupt.
Timer Operation: The timer is reset by software during the
interrupt service routine. It starts running when the first data
transfer task with INT=0 is completed, after the timer was
reset. When the timer reaches the value configured in
ICTOVAL field, it generates an interrupt and stops.
The timer's unit is equal to 1024 clock periods of the clock
whose frequency is specified in the Internal Timer Clock
Frequency field CQCAP register.
- 0x0: Timer is disabled. Timeout-based interrupt is not
generated
- 0x1: Timeout on 01x1024 cycles of timer clock frequency
- 0x2: Timeout on 02x1024 cycles of timer clock frequency
- ........
- 0x7f: Timeout on 127x1024 cycles of timer clock
frequency
In order to write to this field, the TOUT_VAL_WEN bit must
be set at the same write operation.</description>
                <bitRange>[6:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TOUT_VAL_WEN</name>
                <description>When software writes 1 to this bit, the value TOUT_VAL is
updated with the contents written on the same cycle.
Values:
- 0x1 (WEN_SET): Sets TOUT_VAL_WEN
- 0x0 (WEN_CLR): clears TOUT_VAL_WEN</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>INTC_TH</name>
                <description>Interrupt Coalescing Counter Threshold filed
Software uses this field to configure the number of task
completions (only tasks with INT=0 in the Task Descriptor),
which are required in order to generate an interrupt.
Counter Operation: As data transfer tasks with INT=0
complete, they are counted by CQE. The counter is reset by
software during the interrupt service routine. The counter
stops counting when it reaches the value configured in
INTC_TH, and generates interrupt.
- 0x0: Interrupt coalescing feature disabled
- 0x1: Interrupt coalescing interrupt generated after 1 task
when INT=0 completes
- 0x2: Interrupt coalescing interrupt generated after 2 tasks
when INT=0 completes
- ........
- 0x1f: Interrupt coalescing interrupt generated after 31
tasks when INT=0 completes
To write to this field, the INTC_TH_WEN bit must be set
during the same write operation.</description>
                <bitRange>[12:8]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>INTC_TH_WEN</name>
                <description>Interrupt Coalescing Counter Threshold Write Enable
When software writes 1 to this bit, the value INTC_TH is
updated with the contents written on the same cycle.
Values:
- 0x1 (WEN_SET): Sets INTC_TH_WEN
- 0x0 (WEN_CLR): Clears INTC_TH_WEN</description>
                <bitRange>[15:15]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>INTC_RST</name>
                <description>Counter and Timer Reset
When host driver writes 1, the interrupt coalescing timer and
counter are reset.
Values:
- 0x1 (ASSERT_INTC_RESET): Interrupt coalescing timer
and counter are reset
- 0x0 (NO_EFFECT): No Effect</description>
                <bitRange>[16:16]</bitRange>
                <access>write-only</access>
              </field>
              <field>
                <name>INTC_STAT</name>
                <description>Interrupt Coalescing Status Bit
This bit indicates to the software whether any tasks (with
INT=0) have completed and counted towards interrupt
coalescing (that is, this is set if and only if INTC counter &gt; 0).
Values:
- 0x1 (INTC_ATLEAST1_COMP): At least one INT0 task
completion has been counted (INTC counter &gt; 0)
- 0x0 (INTC_NO_TASK_COMP): INT0 Task completions
have not occurred since last counter reset (INTC counter
== 0)</description>
                <bitRange>[20:20]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>INTC_EN</name>
                <description>Interrupt Coalescing Enable Bit
Values:
- 0x1 (ENABLE_INT_COALESCING): Interrupt coalescing
mechanism is active. Interrupts are counted and timed,
and coalesced interrupts are generated
- 0x0 (DISABLE_INT_COALESCING): Interrupt coalescing
mechanism is disabled (Default).</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQTDLBA</name>
            <description>Command Queuing Task Descriptor List Base Address register</description>
            <addressOffset>0x1A0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TDLBA</name>
                <description>This register stores the LSB bits (31:0) of the byte address of
the head of the Task Descriptor List in system memory.
The size of the task descriptor list is 32 * (Task Descriptor
size + Transfer Descriptor size) as configured by the host
driver. This address is set on 1 KB boundary. The lower 10
bits of this register are set to 0 by the software and are
ignored by CQE.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQTDBR</name>
            <description>Command Queuing DoorBell register</description>
            <addressOffset>0x1A8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DBR</name>
                <description>The software configures TDLBA and TDLBAU, and enable
CQE in CQCFG before using this register.
Writing 1 to bit n of this register triggers CQE to start
processing the task encoded in slot n of the TDL. Writing 0
by the software does not have any impact on the hardware,
and does not change the value of the register bit.
CQE always processes tasks according to the order
submitted to the list by CQTDBR write transactions. CQE
processes Data Transfer tasks by reading the Task
Descriptor and sending QUEUED_TASK_PARAMS (CMD44)
and QUEUED_TASK_ADDRESS (CMD45) commands to
the device. CQE processes DCMD tasks (in slot #31, when
enabled) by reading the Task Descriptor, and generating the
command encoded by its index and argument.
The corresponding bit is cleared to 0 by CQE in one of the
following events:
- A task execution is completed (with success or error).
- The task is cleared using CQTCLR register.
- All tasks are cleared using CQCTL register.
- CQE is disabled using CQCFG register.
Software may initiate multiple tasks at the same time (batch
submission) by writing 1 to multiple bits of this register in the
same transaction. In the case of batch submission, CQE
processes the tasks in order of the task index, starting with
the lowest index. If one or more tasks in the batch are
marked with QBR, the ordering of execution is based on said
processing order.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQTCN</name>
            <description>Command Queuing TaskClear Notification register</description>
            <addressOffset>0x1AC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TCN</name>
                <description>Task Completion Notification
Each of the 32 bits are bit mapped to the 32 tasks.
- Bit-N(1): Task-N has completed execution (with success
or errors)
- Bit-N(0): Task-N has not completed, could be pending or
not submitted.
On task completion, software may read this register to know
tasks that have completed. After reading this register,
software may clear the relevant bit fields by writing 1 to the
corresponding bits.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQDQS</name>
            <description>Device queue status register</description>
            <addressOffset>0x1B0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DQS</name>
                <description>Device Queue Status
Each of the 32 bits are bit mapped to the 32 tasks.
- Bit-N(1): Device has marked task N as ready for
execution
- Bit-N(0): Task-N is not ready for execution. This task
could be pending in device or not submitted.
Host controller updates this register with response of the
Device Queue Status command.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQDPT</name>
            <description>Device pending tasks register</description>
            <addressOffset>0x1B4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DPT</name>
                <description>Device-Pending Tasks
Each of the 32 bits are bit mapped to the 32 tasks.
- Bit-N(1): Task-N has been successfully queued into the
device and is awaiting execution
- Bit-N(0): Task-N is not yet queued.
Bit n of this register is set if and only if
QUEUED_TASK_PARAMS (CMD44) and
QUEUED_TASK_ADDRESS (CMD45) were sent for this
specific task and if this task has not been executed.
The controller sets this bit after receiving a successful
response for CMD45. CQE clears this bit after the task has
completed execution.
Software reads this register in the task-discard procedure to
determine if the task is queued in the device.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQTCLR</name>
            <description>Command Queuing DoorBell register</description>
            <addressOffset>0x1B8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TCLR</name>
                <description>Writing 1 to bit n of this register orders CQE to clear a task
that the software has previously issued.
This bit can only be written when CQE is in Halt state as
indicated in CQCFG register Halt bit. When software writes 1
to a bit in this register, CQE updates the value to 1, and
starts clearing the data structures related to the task. CQE
clears the bit fields (sets a value of 0) in CQTCLR and in
CQTDBR once the clear operation is complete. Software
must poll on the CQTCLR until it is cleared to verify that a
clear operation was done.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQSSC1</name>
            <description>CQ Send Status Configuration 1 register</description>
            <addressOffset>0x1C0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x11000</resetValue>
            <resetMask>0xFFFFF</resetMask>
            <fields>
              <field>
                <name>SQSCMD_IDLE_TMR</name>
                <description>This field configures the polling period to be used when
using periodic SEND_QUEUE_STATUS (CMD13) polling.
Periodic polling is used when tasks are pending in the
device, but no data transfer is in progress. When a
SEND_QUEUE_STATUS response indicates that no task is
ready for execution, CQE counts the configured time until it
issues the next SEND_QUEUE_STATUS.
Timer units are clock periods of the clock whose frequency is
specified in the Internal Timer Clock Frequency field CQCAP
register. The minimum value is 0001h (1 clock period) and
the maximum value is FFFFh (65535 clock periods).
For example, a CQCAP field value of 0 indicates a 19.2 MHz
clock frequency (period = 52.08 ns). If the setting in
CQSSC1.CIT is 1000h, the calculated polling period is
4096*52.08 ns= 213.33 ns.
Should be programmed only when CQCFG.CQ_EN is '0'.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SQSCMD_BLK_CNT</name>
                <description>This field indicates when SQS CMD is sent while data
transfer is in progress.
A value of 'n' indicates that CQE sends status command on
the CMD line, during the transfer of data block BLOCK_CNTn,
on the data lines, where BLOCK_CNT is the number of
blocks in the current transaction.
- 0x0: SEND_QUEUE_STATUS (CMD13) command is not
sent during the transaction. Instead, it is sent only when
the data lines are idle.
- 0x1: SEND_QUEUE_STATUS command is to be sent
during the last block of the transaction.
- 0x2: SEND_QUEUE_STATUS command when last 2
blocks are pending.
- 0x3: SEND_QUEUE_STATUS command when last 3
blocks are pending.
- ........
- 0xf: SEND_QUEUE_STATUS command when last 15
blocks are pending.
Should be programmed only when CQCFG.CQ_EN is '0'</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQSSC2</name>
            <description>CQ Send Status Configuration 2 register</description>
            <addressOffset>0x1C4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>SQSCMD_RCA</name>
                <description>This field provides CQE with the contents of the 16-bit RCA
field in SEND_QUEUE_STATUS (CMD13) command
argument.
CQE copies this field to bits 31:16 of the argument when
transmitting SEND_ QUEUE_STATUS (CMD13) command.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQCRDCT</name>
            <description>Command response for direct command register</description>
            <addressOffset>0x1C8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DCMD_RESP</name>
                <description>This register contains the response of the command
generated by the last direct command (DCMD) task that was
sent.
Contents of this register are valid only after bit 31 of
CQTDBR register is cleared by the controller.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CQRMEM</name>
            <description>Command response mode error mask register</description>
            <addressOffset>0x1D0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xFDF9A080</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RESP_ERR_MASK</name>
                <description>The bits of this field are bit mapped to the device response.
This bit is used as an interrupt mask on the device status
filed that is received in R1/R1b responses.
- 1: When a R1/R1b response is received, with a bit i in the
device status set, a RED interrupt is generated.
- 0: When a R1/R1b response is received, bit i in the device
status is ignored.
The reset value of this register is set to trigger an interrupt on
all 'Error' type bits in the device status.
Note: Responses to CMD13 (SQS) encode the QSR so that
they are ignored by this logic.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
