RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
        <register>
          <name>NETWORK_CONFIG</name>
          <description>The network configuration register contains functions for setting the mode of operation for the Gigabit Ethernet MAC.</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2C0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPEED</name>
              <description>Speed - set to logic one to indicate 100Mbps operation, logic zero for 10Mbps.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FULL_DUPLEX</name>
              <description>Full duplex - if set to logic one, the transmit block ignores the state of collision and carrier sense and allows receive while transmitting. Also controls the half_duplex pin.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCARD_NON_VLAN_FRAMES</name>
              <description>Discard non-VLAN frames - when set only VLAN tagged frames will be passed to the address matching logic.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>JUMBO_FRAMES</name>
              <description>Jumbo frames - set to one to enable jumbo frames up to `gem_jumbo_max_length bytes to be accepted. The default length is 10,240 bytes.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COPY_ALL_FRAMES</name>
              <description>Copy all frames - when set to logic one, all valid frames will be accepted.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NO_BROADCAST</name>
              <description>No broadcast - when set to logic one, frames addressed to the broadcast address of all ones will not be accepted.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTICAST_HASH_ENABLE</name>
              <description>Multicast hash enable - when set, multicast frames will be accepted when the 6 bit hash function of the destination address points to a bit that is set in the hash register.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNICAST_HASH_ENABLE</name>
              <description>Unicast hash enable - when set, unicast frames will be accepted when the 6 bit hash function of the destination address points to a bit that is set in the hash register.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RECEIVE_1536_BYTE_FRAMES</name>
              <description>Receive 1536 byte frames - setting this bit means the GEM will accept frames up to 1536 bytes in length. Normally the GEM would reject any frame above 1518 bytes.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTERNAL_ADDRESS_MATCH_ENABLE</name>
              <description>External address match enable - when set the external address match interface can be used to copy frames to memory.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GIGABIT_MODE_ENABLE</name>
              <description>Gigabit mode enable - setting this bit configures the GEM for 1000 Mbps operation.
 0: 10/100 operation using MII interface
 1: Gigabit operation using GMI interface</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCS_SELECT</name>
              <description>PCS select - selects between MII/GMII and TBI</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRY_TEST</name>
              <description>Retry test - must be set to zero for normal operation. If set to one the backoff between collisions will always be one slot time. Setting this bit to one helps test the too many retries condition. Also used in the pause frame tests to reduce the pause counter's decrement time from 512 bit times, to every rx_clk cycle.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSE_ENABLE</name>
              <description>Pause enable - when set, transmission will pause if a non zero 802.3 classic pause frame is received and PFC has not been negotiated.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RECEIVE_BUFFER_OFFSET</name>
              <description>Receive buffer offset - indicates the number of bytes by which the received data is offset from the start of the receive buffer.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LENGTH_FIELD_ERROR_FRAME_DISCARD</name>
              <description>Length field error frame discard - setting this bit causes frames with a measured length shorter than the extracted length field (as indicated by bytes 13 and 14 in a non-VLAN tagged frame) to be discarded. This only applies to frames with a length field less than 0x0600.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FCS_REMOVE</name>
              <description>FCS remove - setting this bit will cause received frames to be written to memory without their frame check sequence (last 4 bytes). The frame length indicated will be reduced by four bytes in this mode.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MDC_CLOCK_DIVISION</name>
              <description>MDC clock division - set according to pclk speed. These three bits determine the number pclk will be divided by to generate MDC. For conformance with the 802.3 specification, MDC must not exceed 2.5 MHz (MDC is only active during MDIO read and write operations). The reset value for this can be changed by defining a new value for gem_mdc_clock_div in gem_defs.v
 000: divide pclk by 8 (pclk up to 20 MHz)
 001: divide pclk by 16 (pclk up to 40 MHz)
 010: divide pclk by 32 (pclk up to 80 MHz)
 011: divide pclk by 48 (pclk up to 120MHz)
 100: divide pclk by 64 (pclk up to 160 MHz)
 101: divide pclk by 96 (pclk up to 240 MHz)
 110: divide pclk by 128 (pclk up to 320 MHz)
 111: divide pclk by 224 (pclk up to 540 MHz). 
Note. The reset value of this field is equal to the gem_mdc_clock_div define, which is user configurable.</description>
              <bitRange>[20:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_BUS_WIDTH</name>
              <description>Data bus width - set according to AMBA (AXI/AHB) or external FIFO data bus width. The reset value for this can be changed by defining a new value for gem_dma_bus_width_def in gem_defs. Only valid bus widths may be written if the system is configured to a maximum width less than 128-bits. 
 00: 32 bit data bus width 01: 64 bit AMBA (AXI/AHB) data bus width 
 10: 128 bit AMBA (AXI/AHB) data bus width
 11: 128 bit AMBA (AXI/AHB) data bus width. 
Note. The reset value of this field is equal to the gem_dma_bus_width_def define, which is user configurable.
Note: 
For AXI_MASTER_PRESENT=1, MXETH only supports 64b DMA data bus width, so must set it 1.
For AXI_MASTER_PRESENT=0, MXETH only supports 32b DMA data bus width, so must set it 0.</description>
              <bitRange>[22:21]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DISABLE_COPY_OF_PAUSE_FRAMES</name>
              <description>Disable copy of pause frames - set to one to prevent pause frames being copied to memory. When set, neither control frames with type id 8808, nor pause frames with destination address 010000c28001 are copied to memory, this functionality was enhanced in release 1p09 (mxeth uses 1p09). Note that valid pause frames received will still increment pause statistics and pause the transmission of frames as required.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RECEIVE_CHECKSUM_OFFLOAD_ENABLE</name>
              <description>Receive checksum offload enable - when set, the receive checksum engine is enabled. Frames with bad IP, TCP or UDP checksums are discarded.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_HALF_DUPLEX_RX</name>
              <description>Enable frames to be received in half-duplex mode while transmitting.
Must set '0', MXETH only supports full-duplex mode.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_RX_FCS</name>
              <description>Ignore RX FCS - when set frames with FCS/CRC errors will not be rejected. FCS error statistics will still be collected for frames with bad FCS and FCS status will be recorded in frame's DMA descriptor. For normal operation this bit must be set to zero.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SGMII_MODE_ENABLE</name>
              <description>SGMII mode enable - changes behaviour of the auto-negotiation advertisement and link partner ability registers to meet the requirements of SGMII and reduces the duration of the link timer from 10 ms to 1.6 ms.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IPG_STRETCH_ENABLE</name>
              <description>IPG stretch enable - when set the transmit IPG can be increased above 96 bit times depending on the previous frame length using the IPG stretch register.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NSP_CHANGE</name>
              <description>Receive bad preamble. When set frames with non-standard preamble are not rejected.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNORE_IPG_RX_ER</name>
              <description>Ignore IPG rx_er. When set rx_er has no effect on the GEMs operation when rx_dv is low. Set this when using the RGMII wrapper in half-duplex mode.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NETWORK_STATUS</name>
          <description>The network status register returns status information with respect to the PHY management interface.</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PCS_LINK_STATE</name>
              <description>Returns status of PCS link state. If auto-negotiation is disabled this returns the synchronisation status. If auto-negotiation is enabled it is set in the LINK_OK state as long as a compatible duplex mode is resolved.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MDIO_IN</name>
              <description>Returns status of the mdio_in pin.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAN_DONE</name>
              <description>The PHY management logic is idle (i.e. has completed).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MAC_FULL_DUPLEX</name>
              <description>PCS auto-negotiation duplex resolution. Set to one if the resolution function determines that both devices are capable of full duplex operation. If zero half-duplex operation is possible as long as bit 0 (PCS link state) is also one.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_5_4</name>
              <description>N/A</description>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PFC_NEGOTIATE_PCLK</name>
              <description>Set when PFC Priority Based Pause has been negotiated.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI_INDICATE_PCLK</name>
              <description>LPI Indication - Low power idle has been detected on receive. This bit is set when LPI is detected and reset when normal idle is detected. An interrupt is generated when the state of this bit changes.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_IO_REGISTER</name>
          <description>Not presents. Access to the register will return AHB error.</description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSVD_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_CONFIG</name>
          <description>DMA Configuration Register</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x180704</resetValue>
          <resetMask>0x77FF3FFF</resetMask>
          <fields>
            <field>
              <name>AMBA_BURST_LENGTH</name>
              <description>Selects the burst length to use on the AMBA (AHB/AXI) when transferring frame data. Not used for DMA management operations and only used where space and data size allow and respecting AXI/AHB burst boundary rules. One-hot priority encoding enforced automatically on register writes as follows, where x represents don't care:
 1xxxx: Attempt to use bursts of up to 16.
 01xxx: Attempt to use bursts of up to 8.
 001xx: Attempt to use bursts of up to 4.
 0001x: Always use SINGLE bursts.
 00001: Always use SINGLE bursts.
 00000: Attempt to use bursts of up to 256.
Note: MXETH only supports burst length up to 16.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HDR_DATA_SPLITTING_EN</name>
              <description>Enable header data Splitting. When set, receive frames will be forwarded to main memory using a minimum of two DMA data buffers. The first X data buffers will contain the frame header, consisting of the Ethernet,VLAN,(IPv4 or IPv6),(TCP or UDP). X= (frame header size divided by rx_buf_size as defined in bits 23:16 of this register). The last Y data buffers will contain the frame payload. Y= (frame payload size divided by rx_buf_size). Note that for non VLAN/IP/TCP/UDP frames, the header will always be 14 bytes. When this feature is disabled, the frame is forwarded to main memory in blocks of rx_buf_size.
Note: For AXI_MASTER_PRESENT=0 i.e. AHB master support, this feature cannot be set.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIAN_SWAP_MANAGEMENT</name>
              <description>endian swap mode enable for management descriptor accesses. When set, selects swapped endianism for AMBA (AXI/AHB) transfers. When clear, selects little endian mode. Note, the default value of this bit equals to `gem_endian_swap_def, which is design time configuration.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDIAN_SWAP_PACKET</name>
              <description>endian swap mode enable for packet data accesses. When set, selects swapped endianism for AMBA (AXI/AHB) transfers. When clear, selects little endian mode. Note, the default value of this bit equals to `gem_endian_swap_def, which is design time configuration.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PBUF_SIZE</name>
              <description>N/A</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PBUF_SIZE</name>
              <description>N/A</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PBUF_TCP_EN</name>
              <description>N/A</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INFINITE_LAST_DBUF_SIZE_EN</name>
              <description>Forces the DMA to consider the data buffer pointed to by last descriptor in the descriptor list to be of infinite size.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_ERROR_REPORT</name>
              <description>When the bit is set, bit 16 of the receive buffer descriptor will represent FCS/CRC error (only if frames with FCS are copied to memory as enabled by bit 26 in the network config register). When this bit is clear, bit 16 of the receive buffer descriptor will represent the Canonical format indicator (CFI) bit as extracted from the receive frame (if the receive buffer descriptor is pointing to the last data buffer of the receive frame and the received frame was VLAN tagged).</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BUF_SIZE</name>
              <description>DMA receive buffer size in external AMBA (AXI/AHB) system memory. The value defined by these bits determines the size of buffer to use in main system memory when writing received data. The value is defined in multiples of 64 bytes.
 0x01 corresponds to buffers of 64 bytes
 0x02 corresponds to 128 bytes etc. 
For example:
 0x02: 128 byte.
 0x18: 1536 byte (1*max length frame/buffer)
 0xA0: 10240 byte (1*10K jumbo frame/buffer) 
Note that this value should never be written as zero. 
Note. The reset value of this field is equal to the gem_rx_buffer_length_def define, which is user configurable.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_DISCARD_ON_ERR</name>
              <description>Auto Discard RX pkts during lack of resource. When set, the GEM DMA will automatically discard receive packets from the receiver packet buffer memory when no AMBA (AXI/AHB) resource is available. When low, then received packets will remain to be stored in the SRAM based packet buffer until AMBA (AXI/AHB) buffer resource next becomes available. A write to this bit is ignored if the DMA is not configured in the packet buffer full store and forward mode.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MAX_AMBA_BURST_RX</name>
              <description>Force max length bursts on RX. Force the RX DMA to always issue max length bursts on EOP(end of packet) or EOB(end of buffer)transfers, even if there is less than max burst real packet data required to write. Any extra bytes of pad data is set to 0x00. Does not apply on bursts that break 1k boundary rule.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_MAX_AMBA_BURST_TX</name>
              <description>Force max length bursts on TX. Force the TX DMA to always issue max length bursts on EOP(end of packet) or EOB(end of buffer) transfers as defined by bits 4:0 of this register, even when there is less that max burst data bytes to read. Residual data read is ignored. Does not apply on bursts that break 1k boundary rule.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_BD_EXTENDED_MODE_EN</name>
              <description>Enable RX extended BD mode. See RX BD control register definition for description of feature.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_BD_EXTENDED_MODE_EN</name>
              <description>Enable TX extended BD mode. See TX BD control register definition for description of feature.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_ADDR_BUS_WIDTH_1</name>
              <description>DMA address bus width. 0 = 32b, 1 = 64b. MXETH only supports 32b DMA address bus width, so must set it 0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
