RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
        <register>
          <name>INT_ENABLE</name>
          <description>At reset all interrupts are disabled. Writing a one to the relevant bit location enables the required interrupt. This register is write only and when read will return zero.</description>
          <addressOffset>0x1028</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE_MANAGEMENT_DONE_INTERRUPT</name>
              <description>Enable management done interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RECEIVE_COMPLETE_INTERRUPT</name>
              <description>Enable receive complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RECEIVE_USED_BIT_READ_INTERRUPT</name>
              <description>Enable receive used bit read interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_USED_BIT_READ_INTERRUPT</name>
              <description>Enable transmit used bit read interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT</name>
              <description>Enable transmit buffer under run interrupt</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT</name>
              <description>Enable retry limit exceeded or late collision interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT</name>
              <description>Enable transmit frame corruption due to AMBA (AXI/AHB) error interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_COMPLETE_INTERRUPT</name>
              <description>Enable transmit complete interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_8</name>
              <description>Not used</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_9</name>
              <description>Not used</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RECEIVE_OVERRUN_INTERRUPT</name>
              <description>Enable receive overrun interrupt</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RESP_NOT_OK_INTERRUPT</name>
              <description>Enable bresp not OK interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT</name>
              <description>Enable pause frame with non-zero pause quantum interrupt</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PAUSE_TIME_ZERO_INTERRUPT</name>
              <description>Enable pause time zero interrupt</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PAUSE_FRAME_TRANSMITTED_INTERRUPT</name>
              <description>Enable pause frame transmitted interrupt</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_15</name>
              <description>Not used</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_16</name>
              <description>Not used</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_17</name>
              <description>Not used</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_DELAY_REQ_FRAME_RECEIVED</name>
              <description>Enable PTP delay_req frame received</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_SYNC_FRAME_RECEIVED</name>
              <description>Enable PTP sync frame received</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_DELAY_REQ_FRAME_TRANSMITTED</name>
              <description>Enable PTP delay_req frame transmitted</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_SYNC_FRAME_TRANSMITTED</name>
              <description>Enable PTP sync frame transmitted</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_PDELAY_REQ_FRAME_RECEIVED</name>
              <description>Enable PTP pdelay_req frame received</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_PDELAY_RESP_FRAME_RECEIVED</name>
              <description>Enable PTP pdelay_resp frame received</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_PDELAY_REQ_FRAME_TRANSMITTED</name>
              <description>Enable PTP pdelay_req frame transmitted</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_PTP_PDELAY_RESP_FRAME_TRANSMITTED</name>
              <description>Enable PTP pdelay_resp frame transmitted</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TSU_SECONDS_REGISTER_INCREMENT</name>
              <description>Enable TSU seconds register increment</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RX_LPI_INDICATION_INTERRUPT</name>
              <description>Enable RX LPI indication interrupt</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_28</name>
              <description>Not used</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TSU_TIMER_COMPARISON_INTERRUPT</name>
              <description>Enable TSU timer comparison interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_DISABLE</name>
          <description>Writing a 1 to the relevant bit location disables that particular interrupt. This register is write only and when read will return zero.</description>
          <addressOffset>0x102C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DISABLE_MANAGEMENT_DONE_INTERRUPT</name>
              <description>'Disable management done interrupt'</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RECEIVE_COMPLETE_INTERRUPT</name>
              <description>'Disable receive complete interrupt'</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RECEIVE_USED_BIT_READ_INTERRUPT</name>
              <description>'Disable receive used bit read interrupt'</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_USED_BIT_READ_INTERRUPT</name>
              <description>'Disable transmit used bit read interrupt'</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_BUFFER_UNDER_RUN_INTERRUPT</name>
              <description>'Disable transmit buffer under run interrupt'</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT</name>
              <description>'Disable retry limit exceeded or late collision interrupt'</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT</name>
              <description>'Disable transmit frame corruption due to AMBA (AHB/AXI) error interrupt'</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TRANSMIT_COMPLETE_INTERRUPT</name>
              <description>'Disable transmit complete interrupt'</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_8</name>
              <description>Not used</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_9</name>
              <description>Not used</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RECEIVE_OVERRUN_INTERRUPT</name>
              <description>'Disable receive overrun interrupt'</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RESP_NOT_OK_INTERRUPT</name>
              <description>'Disable bresp/hresp not OK interrupt'</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PAUSE_FRAME_WITH_NON_ZERO_PAUSE_QUANTUM_INTERRUPT</name>
              <description>'Disable pause frame with non-zero pause quantum interrupt'</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PAUSE_TIME_ZERO_INTERRUPT</name>
              <description>'Disable pause time zero interrupt'</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PAUSE_FRAME_TRANSMITTED_INTERRUPT</name>
              <description>'Disable pause frame transmitted interrupt'</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_15</name>
              <description>Not used</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_16</name>
              <description>Not used</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_17</name>
              <description>Not used</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_DELAY_REQ_FRAME_RECEIVED</name>
              <description>'Disable PTP delay_req frame received'</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_SYNC_FRAME_RECEIVED</name>
              <description>'Disable PTP sync frame received'</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_DELAY_REQ_FRAME_TRANSMITTED</name>
              <description>'Disable PTP delay_req frame transmitted '</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_SYNC_FRAME_TRANSMITTED</name>
              <description>'Disable PTP sync frame transmitted '</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_PDELAY_REQ_FRAME_RECEIVED</name>
              <description>'Disable PTP pdelay_req frame received'</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_PDELAY_RESP_FRAME_RECEIVED</name>
              <description>'Disable PTP pdelay_resp frame received'</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_PDELAY_REQ_FRAME_TRANSMITTED</name>
              <description>'Disable PTP pdelay_req frame transmitted'</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_PTP_PDELAY_RESP_FRAME_TRANSMITTED</name>
              <description>'Disable PTP pdelay_resp frame transmitted'</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TSU_SECONDS_REGISTER_INCREMENT</name>
              <description>'Disable TSU seconds register increment'</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_RX_LPI_INDICATION_INTERRUPT</name>
              <description>'Disable RX LPI indication interrupt'</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UNUSED_28</name>
              <description>Not used</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>DISABLE_TSU_TIMER_COMPARISON_INTERRUPT</name>
              <description>'Disable TSU timer comparison interrupt.'</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RSVD_30_30</name>
              <description>N/A</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_31_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
