RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
        <register>
          <name>CBS_CONTROL</name>
          <description>The IdleSlope value is defined as the rate of change of credit when a packet is waiting to be sent. This must not exceed the portTransmitRate which is dependent on the speed of operation, eg, portTranmsitRate. 1Gb/s = 32'h07735940 (125 Mbytes/s), 100Mb/sec = 32'h017D7840 (25 Mnibbles/s), 10Mb/sec = 32'h002625A0 (2.5 Mnibbles/s). If 50 percent of bandwidth was to be allocated to a particular queue in 1Gb/sec mode then the IdleSlope value for that queue would be calculated as 32'h07735940/2. Note that Credit-Based Shaping should be disabled prior to updating the IdleSlope values. As another example, for a 1722 audio packet with a payload of 6 samples per channel, the packet size would be 7 (preamble) + 1 (SFD) + 50 (packet header) + 6x4x2(payload) + 4 (CRC) = 110 bytes. For a rate of 8000 packets per second, the desired rate would 110 x 8000 bytes per second, so the programmed idleSlope value would be 880000 for a 1Gb/s connection, or 1760000 for a 100Mb/s or 10Mbs connection. See Figure 6.3 in the IEEE 1722 standard. In practice, the actual transmission rate will be vary slightly from that calculated. In this case, the idleSlope value should be recalibrated based on the variance between the measured and expected rate, and in this case very accurate transmission rates can be achieved.</description>
          <addressOffset>0x14BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>CBS_ENABLE_QUEUE_A</name>
              <description>Enable Credit-Based Shaping on the highest priority queue (queue A). Write 1 to enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CBS_ENABLE_QUEUE_B</name>
              <description>Enable Credit-Based shaping on the 2nd highest priority queue (queue B). Write 1 to enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBS_IDLESLOPE_Q_A</name>
          <description>queue A is the highest priority queue. This would be queue 8 in an 8 queue configuration.</description>
          <addressOffset>0x14C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLESLOPE_A</name>
              <description>IdleSlope value for queue A in bytes/sec for gigabit operation and nibbles/sec for 10/100 operation</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CBS_IDLESLOPE_Q_B</name>
          <description>queue B is the 2nd highest priority queue. This would be queue 7 in an 8 queue configuration.</description>
          <addressOffset>0x14C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDLESLOPE_B</name>
              <description>IdleSlope value for queue B in bytes/sec for gigabit operation and nibbles/sec for 10/100 operation</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPPER_TX_Q_BASE_ADDR</name>
          <description>Upper 32 bits of transmit buffer descriptor queue base address.</description>
          <addressOffset>0x14C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UPPER_TX_Q_BASE_ADDR</name>
              <description>Upper 32 bits of transmit buffer descriptor queue base address. Used when 64 bit addressing is enabled. (In releases earlier to 1p06f2 this register also affected the receive descriptor queue.)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_BD_CONTROL</name>
          <description>TX BD control register</description>
          <addressOffset>0x14CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30</resetMask>
          <fields>
            <field>
              <name>TX_BD_TS_MODE</name>
              <description>TX Descriptor Timestamp Insertion mode, 00: TS insertion disable, 01: TS inserted for PTP Event Frames only, 10: TS inserted for All PTP Frames only, 11: TS insertion for All Frames</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_BD_CONTROL</name>
          <description>RX BD control register</description>
          <addressOffset>0x14D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x30</resetMask>
          <fields>
            <field>
              <name>RX_BD_TS_MODE</name>
              <description>RX Descriptor Timestamp Insertion mode, 00: TS insertion disable, 01: TS inserted for PTP Event Frames only, 10: TS inserted for All PTP Frames only, 11: TS insertion for All Frames</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPPER_RX_Q_BASE_ADDR</name>
          <description>Upper 32 bits of receive buffer descriptor queue base address.</description>
          <addressOffset>0x14D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UPPER_RX_Q_BASE_ADDR</name>
              <description>Upper 32 bits of receive buffer descriptor queue base address. Used when 64 bit addressing is enabled.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIDDEN_REG0</name>
          <description>Hidden registers defined in edma_defs.v '`define gem_cbs_port_tx_rate_10m   12'h4e0   // 10M Port TX Rate *** HIDDEN Register ***'. Default value of cbs related hidden registers (0x14E0~0x14E8) are depicted in cbs_control register.</description>
          <addressOffset>0x14E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2625A0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIDDEN0_FIELD</name>
              <description>default value is defined per description of register cbs_control.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIDDEN_REG1</name>
          <description>Hidden registers defined in edma_defs.v '`define gem_cbs_port_tx_rate_100m  12'h4e4   // 100M Port TX Rate *** HIDDEN Register ***'</description>
          <addressOffset>0x14E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x17D7840</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIDDEN1_FIELD</name>
              <description>default value is defined per description of register cbs_control.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIDDEN_REG2</name>
          <description>Hidden registers defined in edma_defs.v '`define gem_cbs_port_tx_rate_1g    12'h4e8       // 1G Port TX Rate *** HIDDEN Register ***'</description>
          <addressOffset>0x14E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7735940</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HIDDEN2_FIELD</name>
              <description>default value is defined per description of register cbs_control.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIDDEN_REG3</name>
          <description>Hidden registers defined in edma_defs.v '`define gem_wd_counter 12'h4ec    // *** HIDDEN Register ***'.</description>
          <addressOffset>0x14EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>HIDDEN3_FIELD</name>
              <description>default value is defined per description of register cbs_control.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIDDEN_REG4</name>
          <description>Hidden registers defined in edma_defs.v '`define gem_axi_tx_full_threshold0 12'h4f8   // AXI full threshold setting *** HIDDEN Register ***'. Note. When using AXI mode with a single port ram ( gem_spram == 1) mode and a 32b dma bus width ( gem_dma_bus_width == 32 or bits 22 to 21 of the network_config register are set to 0) the AXI hidden registers (0x14F8 and 0x14FC) need to be updated (these registers are used for fine tuning AXI dma bursts and normally should not be touched).</description>
          <addressOffset>0x14F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60008</resetValue>
          <resetMask>0x1FF01FF</resetMask>
          <fields>
            <field>
              <name>HIDDEN4_FIELD_L</name>
              <description>The valid bits is defined by `gem_tx_pbuf_addr.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDDEN4_FIELD_H</name>
              <description>The valid bits is defined by `gem_tx_pbuf_addr.</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HIDDEN_REG5</name>
          <description>Hidden registers defined in edma_defs.v '`define gem_axi_tx_full_threshold1 12'h4fc   // AXI full threshold setting *** HIDDEN Register ***'.</description>
          <addressOffset>0x14FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF01FF</resetMask>
          <fields>
            <field>
              <name>HIDDEN5_FIELD_L</name>
              <description>The valid bits is defined by `gem_tx_pbuf_addr.</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIDDEN5_FIELD_H</name>
              <description>The valid bits is defined by `gem_tx_pbuf_addr.</description>
              <bitRange>[24:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_0</name>
          <description>Screening type 1 registers are used to allocate up to 16 priority queues to received frames based on certain IP or UDP fields of incoming frames. Firstly, when DS/TC match enable is set (bit 28), the DS (Differentiated Services) field of the received IPv4 header or TCfield (traffic class) of IPv6 headers are matched against bits 11 to 4. Secondly, when UDP port match enable is set (bit 29), the UDP Destination Port of the received UDP frame is matched against bits 27 to 12. Both UDP and DS/TC matching can be enabled simultaneously or individually. If a match is successful, then the queue value programmed in bits 2 to 0 is allocated to the frame. The required number of Type 1 screening registers is configured in the gem defines file. Up to 16 type 1 screening registers have been allocated APB address space between 0x500 and 0x53C.</description>
          <addressOffset>0x1500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_1</name>
          <description>screening type 1 register 1, same as screening_type_1_register_0</description>
          <addressOffset>0x1504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_2</name>
          <description>screening type 1 register 2, same as screening_type_1_register_0</description>
          <addressOffset>0x1508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_3</name>
          <description>screening type 1 register 3, same as screening_type_1_register_0</description>
          <addressOffset>0x150C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_4</name>
          <description>screening type 1 register 4, same as screening_type_1_register_0</description>
          <addressOffset>0x1510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_5</name>
          <description>screening type 1 register 5, same as screening_type_1_register_0</description>
          <addressOffset>0x1514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_1_REGISTER_6</name>
          <description>screening type 1 register 6, same as screening_type_1_register_0</description>
          <addressOffset>0x1518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>Queue Number (0 to 15)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_MATCH</name>
              <description>DS/TC Match</description>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH</name>
              <description>UDP Port Match</description>
              <bitRange>[27:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTC_ENABLE</name>
              <description>DS/TC Enable</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UDP_PORT_MATCH_ENABLE</name>
              <description>UDP port match enable</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
