RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
        <register>
          <name>SCREENING_TYPE_2_REGISTER_14</name>
          <description>screening type 2 register 14, same as screening_type_2_register_0</description>
          <addressOffset>0x1578</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCREENING_TYPE_2_REGISTER_15</name>
          <description>screening type 2 register 15, same as screening_type_2_register_0</description>
          <addressOffset>0x157C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUEUE_NUMBER</name>
              <description>'Queue Number (0 to 15)'</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_PRIORITY</name>
              <description>'VLAN Priority'</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VLAN_ENABLE</name>
              <description>'VLAN Enable'</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INDEX</name>
              <description>'Index to screener type 2 EtherType register'</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ETHERTYPE_ENABLE</name>
              <description>'EtherType Enable'</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A</name>
              <description>'Compare A - Index to screener type 2 Compare register '</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_A_ENABLE</name>
              <description>'Compare A Enable'</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B</name>
              <description>'Compare B - Index to screener type 2 Compare register'</description>
              <bitRange>[23:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_B_ENABLE</name>
              <description>'Compare B Enable'</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C</name>
              <description>'Compare C - Index to screener type 2 Compare register'</description>
              <bitRange>[29:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPARE_C_ENABLE</name>
              <description>'Compare C Enable'</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_31</name>
              <description>N/A</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_SCHED_CTRL</name>
          <description>This register controls the transmit scheduling algorithm the user can select for each active transmit queue. By default all queues are initialized to fixed priority, with the top indexed queue having overall priority</description>
          <addressOffset>0x1580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_SCHED_Q0</name>
              <description>'Queue 0 selection.
 00 : Fixed Priority
 01 : CBS Enabled only valid for top two enabled queues and if CBS capability selected.
 10 : DWRR Enabled
 11 : ETS Enabled'</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SCHED_Q1</name>
              <description>'Queue 1 selection.
 00 : Fixed Priority
 01 : CBS Enabled only valid for top two enabled queues and if CBS capability selected.
 10 : DWRR Enabled
 11 : ETS Enabled'</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SCHED_Q2</name>
              <description>'Queue 2 selection.
 00 : Fixed Priority
 01 : CBS Enabled only valid for top two enabled queues and if CBS capability selected.
 10 : DWRR Enabled
 11 : ETS Enabled</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_SCHED_Q3</name>
              <description>Write ignore, read 0</description>
              <bitRange>[7:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_31_8</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BW_RATE_LIMIT_Q0TO3</name>
          <description>This register holds the DWRR weighting value or the ETS bandwidth percentage value used by the transmit scheduler for queues 0 to 3.</description>
          <addressOffset>0x1590</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DWRR_ETS_WEIGHT_Q0</name>
              <description>'DWRR Weighting / ETS Bandwidth Allocation for queue 0'</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWRR_ETS_WEIGHT_Q1</name>
              <description>'DWRR Weighting / ETS Bandwidth Allocation for queue 1'</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWRR_ETS_WEIGHT_Q2</name>
              <description>'DWRR Weighting / ETS Bandwidth Allocation for queue 2'</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWRR_ETS_WEIGHT_Q3</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:24]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BW_RATE_LIMIT_Q4TO7</name>
          <description>Not presents. MXETH has only 3 queues.  Access to the register returns AHB error.</description>
          <addressOffset>0x1594</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>'DWRR Weighting / ETS Bandwidth Allocation for queue 0'</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BW_RATE_LIMIT_Q8TO11</name>
          <description>Not presents. MXETH has only 3 queues.  Access to the register returns AHB error.</description>
          <addressOffset>0x1598</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BW_RATE_LIMIT_Q12TO15</name>
          <description>Not presents. MXETH has only 3 queues.  Access to the register returns AHB error.</description>
          <addressOffset>0x159C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_Q_SEG_ALLOC_Q0TO7</name>
          <description>This register allows the user to distribute the Transmit SRAM used by the DMA across the priority queues, for queues 0 to 7. The SRAM itself is split into a number of evenly sized segments (this is defined in the verilog configuration defs file - for the configuration used to generate this register description, the total number of segments was set to '16'). Those segments can then be freely distributed across the active queues, in powers of 2. I.e. a value of 0 would mean 1 segment has been allocated to the queue. A value of 1 would mean 2 segments, a value of 2 means 4 segments and so on. The reset values of these registers are defined in the configuration defs file.</description>
          <addressOffset>0x15A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEGMENT_ALLOC_Q0</name>
              <description>Number of segments allocated to q0. This should be entered as a log 2, for example entering a value of 2 would grant 4 segments. A maximum of 32 segments can be granted. The default value is determined by `gem_tx_pbuf_num_segments_q0</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_3_3</name>
              <description>N/A</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SEGMENT_ALLOC_Q1</name>
              <description>Number of segments allocated to q1. This should be entered as a log 2, for example entering a value of 2 would grant 4 segments. A maximum of 32 segments can be granted</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_7_7</name>
              <description>N/A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SEGMENT_ALLOC_Q2</name>
              <description>Number of segments allocated to q2. This should be entered as a log 2, for example entering a value of 2 would grant 4 segments. A maximum of 32 segments can be granted</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_11_11</name>
              <description>Write ignore, read 0</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_14_12</name>
              <description>Write ignore, read 0</description>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_15_15</name>
              <description>Write ignore, read 0</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_18_16</name>
              <description>Write ignore, read 0</description>
              <bitRange>[18:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_19_19</name>
              <description>Write ignore, read 0</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_22_20</name>
              <description>Write ignore, read 0</description>
              <bitRange>[22:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_23</name>
              <description>Write ignore, read 0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_26_24</name>
              <description>Write ignore, read 0</description>
              <bitRange>[26:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_27_27</name>
              <description>Write ignore, read 0</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REMOVED_30_28</name>
              <description>Write ignore, read 0</description>
              <bitRange>[30:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSVD_31_31</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_Q_SEG_ALLOC_Q8TO15</name>
          <description>Not presents.  Access to the register returns AHB error.</description>
          <addressOffset>0x15A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECEIVE_Q8_PTR</name>
          <description>receive_q8_ptr to receive_q15_ptr doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x15C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RECEIVE_Q15_PTR</name>
          <description>Not presents.</description>
          <addressOffset>0x15DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RXBUF_SIZE_Q8</name>
          <description>dma_rxbuf_size_q8 to dma_rxbuf_size_q15 doesn't present.  Access to the register returns AHB error.</description>
          <addressOffset>0x15E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RXBUF_SIZE_Q15</name>
          <description>Not presents.</description>
          <addressOffset>0x15FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMOVED_31_0</name>
              <description>Write ignore, read 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_Q1_ENABLE</name>
          <description>At reset all interrupts are disabled. Writing a one to the relevant bit location enables the required interrupt. This register is write only and when read will return zero.</description>
          <addressOffset>0x1600</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8E6</resetMask>
          <fields>
            <field>
              <name>ENABLE_RECEIVE_COMPLETE_INTERRUPT</name>
              <description>Enable Receive complete interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RX_USED_BIT_READ_INTERRUPT</name>
              <description>Enable RX used bit read interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RETRY_LIMIT_EXCEEDED_OR_LATE_COLLISION_INTERRUPT</name>
              <description>Enable Retry limit exceeded or late collision interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_FRAME_CORRUPTION_DUE_TO_AMBA_ERROR_INTERRUPT</name>
              <description>Enable Transmit frame corruption due to AMBA (AXI/AHB) error interrupt</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_TRANSMIT_COMPLETE_INTERRUPT</name>
              <description>Enable Transmit complete interrupt</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ENABLE_RESP_NOT_OK_INTERRUPT</name>
              <description>Enable bresp not OK interrupt</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
