RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2S0">
      <name>I2S1</name>
      <baseAddress>0x40801000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2S0">
      <name>I2S2</name>
      <baseAddress>0x40802000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PASS0</name>
      <description>Programmable Analog Subsystem for S40E</description>
      <headerStructName>PASS</headerStructName>
      <baseAddress>0x40900000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>1048576</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>3</dim>
          <dimIncrement>4096</dimIncrement>
          <name>SAR[%s]</name>
          <description>SAR ADC with Sequencer for S40E</description>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>CTL</name>
            <description>Analog control register.</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xE00007FF</resetMask>
            <fields>
              <field>
                <name>PWRUP_TIME</name>
                <description>Number cycles to wait to power up after IDLE_PWRDWN.
Check the STATUS.PWRUP_BUSY flag to see if the delay is still in progress.
The power up delay is 1 us.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IDLE_PWRDWN</name>
                <description>When idle automatically power down the analog.
After an automatic power down a new trigger will power up the analog, however it will take PWRUP_TIME cycles before the first acquisition can be started. Note that re-arbitration happens at that time, i.e. the trigger that caused the power up may not get handled first.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MSB_STRETCH</name>
                <description>When set use 2 cycles for the Most Significant Bit (MSB)
- 0: Use 1 clock cycle for MSB
- 1: Use 2 clock cycles for MSB</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HALF_LSB</name>
                <description>When set take an extra cycle to convert the half LSB and add it to 12-bit result for Missing Code Recovery
This bit should always be set to '1'
- 0: disable half LSB conversion (not recommended)
- 1: enable half LSB conversion</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SARMUX_EN</name>
                <description>Enable the SARMUX (only valid if ENABLED=1)
- 0: SARMUX disabled (put analog in power down)
- 1: SARMUX enabled.</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADC_EN</name>
                <description>Enable the SAR ADC and SAR sequencer (only valid if ENABLED=1)
- 0: SARADC and SARSEQ are disabled (put SARADC analog in power down and stop clocks), also clears all pending triggers.
- 1: SAR ADC and SARSEQ are enabled.
To enable ADC0 to borrow SARMUX1-3 the corresponding ADC_EN must  be set to 0.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLED</name>
                <description>- 0: SAR IP disabled (put analog in power down and stop clocks), also clears all pending triggers.
- 1: SAR IP enabled.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIAG_CTL</name>
            <description>Diagnostic Reference control register.</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x8000000F</resetMask>
            <fields>
              <field>
                <name>DIAG_SEL</name>
                <description>Select Diagnostic Reference function</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VREFL</name>
                    <description>DiagOut = VrefL</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_1DIV8</name>
                    <description>DiagOut = VrefH * 1/8</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_2DIV8</name>
                    <description>DiagOut = VrefH * 2/8</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_3DIV8</name>
                    <description>DiagOut = VrefH * 3/8</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_4DIV8</name>
                    <description>DiagOut = VrefH * 4/8</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_5DIV8</name>
                    <description>DiagOut = VrefH * 5/8</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_6DIV8</name>
                    <description>DiagOut = VrefH * 6/8</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH_7DIV8</name>
                    <description>DiagOut = VrefH * 7/8</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFH</name>
                    <description>DiagOut = VrefH</description>
                    <value>8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VREFX</name>
                    <description>DiagOut = VrefX = VrefH * 199/200</description>
                    <value>9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VBG</name>
                    <description>DiagOut = Vbg from SRSS</description>
                    <value>10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIN1</name>
                    <description>DiagOut = Vin1</description>
                    <value>11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIN2</name>
                    <description>DiagOut = Vin2</description>
                    <value>12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VIN3</name>
                    <description>DiagOut = Vin3</description>
                    <value>13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I_SOURCE</name>
                    <description>DiagOut = Isource (10uA)</description>
                    <value>14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I_SINK</name>
                    <description>DiagOut = Isink (10uA)</description>
                    <value>15</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DIAG_EN</name>
                <description>Diagnostic Reference enable (only valid if ENABLED=1)
- 0: Diagnostic Reference disabled (powered down resistor ladder and current mirrors, DiagOut = Vssa).
- 1: Diagnostic Reference enabled, output signal select according to DIAG_SEL (note also EPASS_MMIO.PASS_CTL.REFBUF_EN must be set).</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PRECOND_CTL</name>
            <description>Preconditioning control register.</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>PRECOND_TIME</name>
                <description>Number ADC clock cycles that Preconditioning is done before the sample window starts. If OVERLAP_EN=0 there will be 1 additional break before make cycle between preconditioning and sampling.
Note that the minimum value is 1 (0 gives the same result as 1).</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ANA_CAL</name>
            <description>Current analog calibration values</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F00FF</resetMask>
            <fields>
              <field>
                <name>AOFFSET</name>
                <description>Analog offset correction</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGAIN</name>
                <description>Analog gain correction</description>
                <bitRange>[20:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIG_CAL</name>
            <description>Current digital calibration values</description>
            <addressOffset>0x84</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F0FFF</resetMask>
            <fields>
              <field>
                <name>DOFFSET</name>
                <description>Digital offset correction
Subtract DOFFSET from ADC output.</description>
                <bitRange>[11:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DGAIN</name>
                <description>Digital gain correction.
Signed value to correct +/- 30 codes for the maximum input voltage.
Corrected = (D - DOFFSET) + ( (D - DOFFSET) * DGAIN + 0x800) / 0x1000</description>
                <bitRange>[21:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ANA_CAL_ALT</name>
            <description>Alternate analog calibration values</description>
            <addressOffset>0x90</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F00FF</resetMask>
            <fields>
              <field>
                <name>AOFFSET</name>
                <description>See corresponding ANA_CAL field</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AGAIN</name>
                <description>See corresponding ANA_CAL field</description>
                <bitRange>[20:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIG_CAL_ALT</name>
            <description>Alternate digital calibration values</description>
            <addressOffset>0x94</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F0FFF</resetMask>
            <fields>
              <field>
                <name>DOFFSET</name>
                <description>See corresponding DIG_CAL field</description>
                <bitRange>[11:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DGAIN</name>
                <description>See corresponding DIG_CAL field</description>
                <bitRange>[21:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CAL_UPD_CMD</name>
            <description>Calibration update command</description>
            <addressOffset>0x98</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>UPDATE</name>
                <description>Calibration update command: coherently copy values from alternate calibration regs to current calibration regs.
Software sets this bit when the alternate calibration values have been set with the new values. Hardware will do the calibration update as soon as the ADC is idle or a 'continuous' triggered group completes. This ensures that all acquisitions within a group scan (even if preempted) are done with the same calibration values.
This bit is cleared at the same time the calibration update is done. By clearing this bit software can cancel a requested update.
Note: if the ADC is always busy with acquisitions for non continuously triggered groups/channels then the calibration update will remain pending forever. In such a case the software can either  do a non coherent update by writing directly to the current calibration registers, or software can force the ADC to idle by disabling some or all channels.
Software can check/poll this bit to see if the calibration update has taken effect.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TR_PEND</name>
            <description>Trigger pending status</description>
            <addressOffset>0x100</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TR_PEND</name>
                <description>Trigger Pending. 
Hardware will set this bit if a hardware trigger is received.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WORK_VALID</name>
            <description>Channel working data register 'valid' bits</description>
            <addressOffset>0x180</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WORK_VALID</name>
                <description>If set the corresponding WORK register is valid, i.e. was already acquired during the current group scan. If this bit is low then either the channel is not enabled, not yet acquired or it is used as a pulse detect channel.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WORK_RANGE</name>
            <description>Range detected</description>
            <addressOffset>0x184</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RANGE</name>
                <description>N/A</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WORK_RANGE_HI</name>
            <description>Range detect above Hi flag</description>
            <addressOffset>0x188</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ABOVE_HI</name>
                <description>Out of range was detected and the value was above the Hi threshold</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WORK_PULSE</name>
            <description>Pulse detected</description>
            <addressOffset>0x18C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PULSE</name>
                <description>N/A</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT_VALID</name>
            <description>Channel result data register 'valid' bits</description>
            <addressOffset>0x1A0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RESULT_VALID</name>
                <description>If set the corresponding RESULT register is valid, i.e. was acquired during the preceding group scan. If this bit is low, after a group scan completed, then either the channel is not enabled or is used as a pulse  detect channel.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RESULT_RANGE_HI</name>
            <description>Channel Range above Hi flags</description>
            <addressOffset>0x1A4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ABOVE_HI</name>
                <description>Out of range was detected and the value was above the Hi threshold</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Current status of internal SAR registers (mostly for debug)</description>
            <addressOffset>0x200</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xE000371F</resetMask>
            <fields>
              <field>
                <name>CUR_CHAN</name>
                <description>current channel being acquired, only valid if BUSY.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CUR_PRIO</name>
                <description>priority of current group/channel, only valid if BUSY.</description>
                <bitRange>[10:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CUR_PREEMPT_TYPE</name>
                <description>Preempting type of current group/channel, only valid if BUSY.</description>
                <bitRange>[13:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>DBG_FREEZE</name>
                <description>If high then the SAR is prevented from starting a new acquisition, see DBG_FREEZE_EN.</description>
                <bitRange>[29:29]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>PWRUP_BUSY</name>
                <description>If high then the SAR is waiting for PWRUP_TIME due to IDLE_PWRDWN</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>BUSY</name>
                <description>If high then the SAR is busy with a conversion.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AVG_STAT</name>
            <description>Current averaging status (for debug)</description>
            <addressOffset>0x204</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF0FFFFF</resetMask>
            <fields>
              <field>
                <name>CUR_AVG_ACCU</name>
                <description>the current value of the averaging accumulator</description>
                <bitRange>[19:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CUR_AVG_CNT</name>
                <description>the current value of the averaging counter. Note that the value shown is updated after the sample window and therefore runs ahead of the accumulator update.</description>
                <bitRange>[31:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
