RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
          <cluster>
            <dim>32</dim>
            <dimIncrement>64</dimIncrement>
            <name>CH[%s]</name>
            <description>Channel structure</description>
            <addressOffset>0x00000800</addressOffset>
            <register>
              <name>TR_CTL</name>
              <description>Trigger control.</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x800</resetValue>
              <resetMask>0x80000B77</resetMask>
              <fields>
                <field>
                  <name>SEL</name>
                  <description>Trigger select</description>
                  <bitRange>[2:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>OFF</name>
                      <description>Use for channels in group, except the first channel</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TCPWM</name>
                      <description>Trigger from corresponding TCPWM channel</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GENERIC0</name>
                      <description>Generic trigger input 0</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GENERIC1</name>
                      <description>N/A</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GENERIC2</name>
                      <description>N/A</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GENERIC3</name>
                      <description>N/A</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GENERIC4</name>
                      <description>N/A</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CONTINUOUS</name>
                      <description>Always triggered (also called idle), can only be used for at most 1 channel</description>
                      <value>7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PRIO</name>
                  <description>Channel priority:
'0': highest priority.
'1'
...
'6'
'7': lowest priority.

Channels with the same priority constitute a priority level. Priority decoding determines the highest priority pending channel. This channel is determined as follows. First, the highest priority level with pending channels is identified. Second, within this priority level, round robin arbitration is applied. Round robin arbitration (within a priority level) gives the highest priority to the lower channel indices (within the priority level).</description>
                  <bitRange>[6:4]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PREEMPT_TYPE</name>
                  <description>Preemption type allow for this group</description>
                  <bitRange>[9:8]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ABORT_CANCEL</name>
                      <description>Abort ongoing acquisition, do not return
Clear pending trigger for aborted group and set Cancelled interrupt.
Also 'Abort' whenever this group (do not pend the trigger) is not immediately scheduled for acquisition after a new trigger arrives. 
For this preemption type only, only a positive edge on the trigger can trigger the channel, i.e. CONTINUOUS or level high operation is not supported (to avoid continuous Cancelled interrupts).
In case CTL.IDLE_PWRDWN is used and the analog is powered down, the group cannot be immediately scheduled for acquisition and therefore a trigger for a group with this preemption type will power up the analog, but the group will ABORT and set the Cancelled interrupt</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ABORT_RESTART</name>
                      <description>Abort ongoing acquisition, up on return Restart group from first channel.</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ABORT_RESUME</name>
                      <description>Abort ongoing acquisition, up on return Resume group from aborted channel
If averaging, discard averaging results so far and restart averaging.</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FINISH_RESUME</name>
                      <description>Complete ongoing acquisition (including averaging), up on return Resume group from next channel</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>GROUP_END</name>
                  <description>0: continue group with next channel
1: last channel of a group.

Note that for the channel with the highest index (SAR_CH_NR) this always needs to be set</description>
                  <bitRange>[11:11]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DONE_LEVEL</name>
                  <description>select level or pulse for 'tr_ch_done' trigger output 
Also see POST_CTL.TR_DONE_GRP_VIO</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PULSE</name>
                      <description>tr_ch_done generates a 2 cycle pulse (clk_sys), no need to read the result to clear (also no ch_overflow detection)</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>LEVEL</name>
                      <description>tr_ch_done  is a level output until the result register is read (typical for DW usage, this also enables ch_overflow detection when DW is too slow)</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SAMPLE_CTL</name>
              <description>Sample control.</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x0</resetMask>
              <fields>
                <field>
                  <name>PIN_ADDR</name>
                  <description>N/A</description>
                  <bitRange>[5:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PORT_ADDR</name>
                  <description>Select the physical port. This field is only valid for ADC0.
ADC0 can control and connect to the SARMUX of the neighboring ADC1-3. This requires the corresponding ADC to be off while the SARMUX is left on.
When ADC0 controls another SARMUX it uses the PIN_ADDR, EXT_MUX_EN/SEL of this channel to control the other SARMUX.</description>
                  <bitRange>[7:6]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SARMUX0</name>
                      <description>ADC uses it's own SARMUX</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SARMUX1</name>
                      <description>ADC0 uses SARMUX1 (only valid for ADC0, undefined result if used for ADC1-3)</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SARMUX2</name>
                      <description>ADC0 uses SARMUX2 (only valid for ADC0, undefined result if used for ADC1-3)</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SARMUX3</name>
                      <description>ADC0 uses SARMUX3 (only valid for ADC0, undefined result if used for ADC1-3)</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>EXT_MUX_SEL</name>
                  <description>External analog mux select.
This bit setting is related to EXT_MUX[x]_y on pin assignment.
 0x0: Select EXT_MUX[x]_0 pin
 0x1: Select EXT_MUX[x]_1 pin</description>
                  <bitRange>[10:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EXT_MUX_EN</name>
                  <description>External analog mux enable.
This enable can  be used as enable (chip select) for the external analog mux (this enable is not used as enable for the GPIO output driver).
This enable also prevents unnecessary toggle activity on the select signals of the external analog mux. When this enable is low EXT_MUX_SEL value will be ignored and the previous value will be maintained.  
Note that an external analog mux can only be used in combination with a pin input, i.e. PIN_ADDR&lt;32 or Vmotor. If an internal signal is selected this enable should be 0.</description>
                  <bitRange>[11:11]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PRECOND_MODE</name>
                  <description>Select preconditioning mode.
Preconditioning (dis)charges the SAR sample capacitor to the selected reference voltage for PRECOND_TIME (global) cycles, a break before make cycle will be inserted before sampling starts (SAMPLE_TIME).</description>
                  <bitRange>[13:12]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>OFF</name>
                      <description>No preconditioning</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VREFL</name>
                      <description>Discharge to VREFL</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VREFH</name>
                      <description>Charge to VREFH</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DIAG</name>
                      <description>Connect the Diagnostic reference output during preconditioning. The Diagnostic reference should be configured to output a reference voltage.
Note: this selection is mutual exclusive with using the Diagnostic reference to supply an ibias current for OVERLAP.</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>OVERLAP_DIAG</name>
                  <description>Select Overlap mode or SARMUX Diagnostics, in both cases the Diagnostic reference is used.
With Overlap the Diagnostic reference typically sources or sinks a small current which is connected at the same time as the analog signal being sampled.
For SARMUX Diagnostics the Diagnostic reference should provide a reference voltage which is selected at the SARMUX input instead of the normal analog signal being sampled.</description>
                  <bitRange>[15:14]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>OFF</name>
                      <description>No overlap or SARMUX Diagnostics</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>HALF</name>
                      <description>Sample the selected analog input for 2 SAMPLE_TIME periods. During the first period use overlap sampling, i.e. connect both the analog input and Diagnostic reference. During second period only connect the analog input.</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FULL</name>
                      <description>Like normal sample the selected analog input for a single SAMPLE_TIME period but use overlap sampling, i.e. connect both the analog input and Diagnostic reference.</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MUX_DIAG</name>
                      <description>Select Diagnostic reference instead of analog signal at the input of the SARMUX. This enables a functional safety check of the SARMUX analog connections.</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SAMPLE_TIME</name>
                  <description>Sample time (aperture) in ADC clock cycles. Minimum is 1 (0 gives the same result as 1), minimum time needed for proper settling is at least 300ns, i.e. 6 clock cycles at the max frequency of 20MHz.</description>
                  <bitRange>[27:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>ALT_CAL</name>
                  <description>Use alternate calibration values instead of the current calibration values.
This allows the firmware to allocate one or more channels to quietly re-calibrate the ADC in the background of regular processing.
0 = use regular calibration values (ANA/DIG_CAL)
1 = use alternate calibration values (ANA/DIG_CAL_ALT)
Note: typically calibration measurements select VrefL (PIN_ADDR=62) or VrefH (PIN_ADDR=63)</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>POST_CTL</name>
              <description>Post processing control</description>
              <addressOffset>0x8</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x0</resetMask>
              <fields>
                <field>
                  <name>POST_PROC</name>
                  <description>Post processing</description>
                  <bitRange>[2:0]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NONE</name>
                      <description>No postprocessing</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AVG</name>
                      <description>Averaging</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>AVG_RANGE</name>
                      <description>Averaging followed by Range detect</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RANGE</name>
                      <description>Range detect</description>
                      <value>3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RANGE_PULSE</name>
                      <description>Range detect followed by pulse detect</description>
                      <value>4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RSVD0</name>
                      <description>N/A</description>
                      <value>5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RSVD1</name>
                      <description>N/A</description>
                      <value>6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RSVD2</name>
                      <description>N/A</description>
                      <value>7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LEFT_ALIGN</name>
                  <description>Left or right align data in result[15:0]. 
0: the data is right aligned in result[11:0], with sign extension to 16 bits if enabled
1: the data is left aligned in result[15:4] with the lower nibble 0. Caveat if the result was more than 12 bits (e.g. after averaging) then the bits above 12 will be discarded.</description>
                  <bitRange>[6:6]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SIGN_EXT</name>
                  <description>Output data is sign extended</description>
                  <bitRange>[7:7]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>UNSIGNED</name>
                      <description>Default: result data is unsigned (zero extended if needed)</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SIGNED</name>
                      <description>Result data is signed (sign extended if needed)</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AVG_CNT</name>
                  <description>Either averaging count (minus 1) or Pulse positive reload value

Averaging Count for channels that have averaging enabled. A channel will be sampled (AVG_CNT+1) = [1..256] times.
The signal will be acquired back to back  (1st order accumulate and dump filter), the average result is calculated and stored and then the next enabled channel is sampled.
If more than 16 sample are taken (AVG_CNT&gt;=16) then AVG_SHIFT must be set so that the result after shifting fits in 16 bits

Pulse detect positive reload value PULSE_POS_RL[7:0]</description>
                  <bitRange>[15:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>SHIFT_R</name>
                  <description>Either Shift Right (no pulse detection) or Pulse negative reload value (if pulse detection is enabled)

