RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
Shift right SHIFT_R[3:0] = [0..12]: the result (typically after averaging) is shifted right as specified here. Software has to make sure that the result fits in less than 16 bits. 
Any value &gt;12 will be treated as 12, bit [4] is always ignored. This can also be used to fit the 12-bit result in 8 bits.

Pulse detect negative reload value PULSE_NEG_RL[4:0]</description>
                  <bitRange>[20:16]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>RANGE_MODE</name>
                  <description>Range detect mode</description>
                  <bitRange>[23:22]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>BELOW_LO</name>
                      <description>Below Low threshold (result &lt; Lo)</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INSIDE_RANGE</name>
                      <description>Inside range (Lo &lt;= result &lt; Hi)</description>
                      <value>1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ABOVE_HI</name>
                      <description>Above high threshold (Hi &lt;= result)</description>
                      <value>2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OUTSIDE_RANGE</name>
                      <description>Outside range (result &lt; Lo || Hi &lt;= result)</description>
                      <value>3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TR_DONE_GRP_VIO</name>
                  <description>Select tr_sar_ch_done mode for last channel of a group, ignored for all other channels
Also see TR_CTL.DONE_LEVEL</description>
                  <bitRange>[25:25]</bitRange>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DONE</name>
                      <description>Default: tr_sar_ch_done is set when the group is done</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>GRP_RANGE_VIO</name>
                      <description>tr_sar_ch_done  is only set if any of the channels in the group has a Range Violation. This mode is ignored if this is not the last channel in the group.
Note that if none of the channels in the group have Range detection enabled then the trigger will never get set.</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RANGE_CTL</name>
              <description>Range thresholds</description>
              <addressOffset>0xC</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x0</resetMask>
              <fields>
                <field>
                  <name>RANGE_LO</name>
                  <description>Range detect low threshold (Lo)</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>RANGE_HI</name>
                  <description>Range detect high threshold (Hi)</description>
                  <bitRange>[31:16]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR</name>
              <description>Interrupt request register.</description>
              <addressOffset>0x10</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x707</resetMask>
              <fields>
                <field>
                  <name>GRP_DONE</name>
                  <description>Done Interrupt: hardware sets this interrupt for the last channel of a group if the group scan is done. Write with '1' to clear bit.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GRP_CANCELLED</name>
                  <description>Cancelled Interrupt: hardware sets this interrupt for the last channel of a group if the group scan was preempted and CANCELLED. Note that it is possible that also the GRP_DONE interrupt is set. If that is the case one or more new triggers were detected while the group was already busy, i.e. triggers are too fast.   Write with '1' to clear bit.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GRP_OVERFLOW</name>
                  <description>Overflow Interrupt: hardware sets this interrupt for the last channel of a group if the group scan is done and the Done interrupt is already (still) pending. Write with '1' to clear bit.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_RANGE</name>
                  <description>Range detect Interrupt: hardware sets this interrupt for each channel if the conversion result (after averaging) of that channel met the condition specified by the SAR_RANGE registers. This interrupt is mutual exclusive with Pulse detect interrupt. Write with '1' to clear bit.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_PULSE</name>
                  <description>Pulse detect Interrupt: hardware sets this interrupt for each channel if the positive pulse counter reaches zero. This interrupt is mutual exclusive with Range detect interrupt. Write with '1' to clear bit.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_OVERFLOW</name>
                  <description>Channel overflow Interrupt: hardware sets this interrupt for each channel if a new Pulse or Range interrupt is detected while the interrupt is still pending or when DW did not acknowledge data pickup. Write with '1' to clear bit.</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_SET</name>
              <description>Interrupt set request register</description>
              <addressOffset>0x14</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x707</resetMask>
              <fields>
                <field>
                  <name>GRP_DONE_SET</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GRP_CANCELLED_SET</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GRP_OVERFLOW_SET</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_RANGE_SET</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_PULSE_SET</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_OVERFLOW_SET</name>
                  <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_MASK</name>
              <description>Interrupt mask register.</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x707</resetMask>
              <fields>
                <field>
                  <name>GRP_DONE_MASK</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GRP_CANCELLED_MASK</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>GRP_OVERFLOW_MASK</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_RANGE_MASK</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_PULSE_MASK</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-write</access>
                </field>
                <field>
                  <name>CH_OVERFLOW_MASK</name>
                  <description>Mask bit for corresponding bit in interrupt request register.</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>INTR_MASKED</name>
              <description>Interrupt masked request register</description>
              <addressOffset>0x1C</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x707</resetMask>
              <fields>
                <field>
                  <name>GRP_DONE_MASKED</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>GRP_CANCELLED_MASKED</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>GRP_OVERFLOW_MASKED</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CH_RANGE_MASKED</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CH_PULSE_MASKED</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CH_OVERFLOW_MASKED</name>
                  <description>Logical and of corresponding request and mask bits.</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>WORK</name>
              <description>Working data register</description>
              <addressOffset>0x20</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xF0000000</resetMask>
              <fields>
                <field>
                  <name>WORK</name>
                  <description>SAR conversion working data of the channel. The data is written here right after sampling this channel.</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>ABOVE_HI_MIR</name>
                  <description>mirror bit of the corresponding ABOVE_HI bit</description>
                  <bitRange>[28:28]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RANGE_MIR</name>
                  <description>mirror bit of corresponding bit in WORK_RANGE register</description>
                  <bitRange>[29:29]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>PULSE_MIR</name>
                  <description>mirror bit of corresponding bit in WORK_PULSE register</description>
                  <bitRange>[30:30]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>VALID_MIR</name>
                  <description>mirror bit of corresponding bit in WORK_VALID register</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RESULT</name>
              <description>Result data register</description>
              <addressOffset>0x24</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0xF0000000</resetMask>
              <fields>
                <field>
                  <name>RESULT</name>
                  <description>SAR conversion result of the channel. The data is copied here from the WORK field after all enabled channels in this scan have been sampled.</description>
                  <bitRange>[15:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>ABOVE_HI_MIR</name>
                  <description>mirror bit of the corresponding ABOVE_HI bit</description>
                  <bitRange>[28:28]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RANGE_INTR_MIR</name>
                  <description>mirror bit of INTR.CH_RANGE bit</description>
                  <bitRange>[29:29]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>PULSE_INTR_MIR</name>
                  <description>mirror bit of INTR.CH_PULSE bit</description>
                  <bitRange>[30:30]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>VALID_MIR</name>
                  <description>mirror bit of the corresponding bit in RESULT_VALID register</description>
                  <bitRange>[31:31]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>GRP_STAT</name>
              <description>Group status register</description>
              <addressOffset>0x28</addressOffset>
              <size>32</size>
              <access>read-only</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x10707</resetMask>
              <fields>
                <field>
                  <name>GRP_COMPLETE</name>
                  <description>Group acquisition complete. 
This is a copy of the INTR.GRP_DONE bit.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>GRP_CANCELLED</name>
                  <description>Group Cancelled. 
This is a copy of the INTR.GRP_CANCELLED bit.</description>
                  <bitRange>[1:1]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>GRP_OVERFLOW</name>
                  <description>Group Overflow. 
This is a copy of the INTR.GRP_OVERFLOW bit.</description>
                  <bitRange>[2:2]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CH_RANGE_COMPLETE</name>
                  <description>Channel Range complete. 
This is a copy of the INTR.CH_RANGE bit.</description>
                  <bitRange>[8:8]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CH_PULSE_COMPLETE</name>
                  <description>Channel Pulse complete. 
This is a copy of the INTR.CH_PULSE bit.</description>
                  <bitRange>[9:9]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CH_OVERFLOW</name>
                  <description>Channel Overflow. 
This is a copy of the INTR.CH_OVERFLOW bit.</description>
                  <bitRange>[10:10]</bitRange>
                  <access>read-only</access>
                </field>
                <field>
                  <name>GRP_BUSY</name>
                  <description>Group acquisition busy. 
This is a copy of the TR_PENDING bit of the first channel of the group.</description>
                  <bitRange>[16:16]</bitRange>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>ENABLE</name>
              <description>Enable register</description>
              <addressOffset>0x38</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x1</resetMask>
              <fields>
                <field>
                  <name>CHAN_EN</name>
                  <description>Channel enable. 
- 0: the corresponding channel is disabled. Corresponding trigger will be reset immediately.
- 1: the corresponding channel is enabled.

Note: To disable a group either stop the trigger first or begin with disabling the lowest channel first. To enable a group either start with enabling the last channel first and the first channel last, or start the trigger after all channels are enabled. If these rules are not followed the result is undefined.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TR_CMD</name>
              <description>Software triggers</description>
              <addressOffset>0x3C</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x1</resetMask>
              <fields>
                <field>
                  <name>START</name>
                  <description>Software start trigger. When written with '1', a start trigger is generated which sets the corresponding TR_PEND bit (only if the channel is enabled). A read always returns a 0.</description>
                  <bitRange>[0:0]</bitRange>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
