RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1C/svd/cat1c4m.svd
        <cluster>
          <name>EPASS_MMIO</name>
          <description>PASS top-level MMIO (Generic Triggers)</description>
          <addressOffset>0x000F0000</addressOffset>
          <register>
            <name>PASS_CTL</name>
            <description>PASS control register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF0600033</resetMask>
            <fields>
              <field>
                <name>SUPPLY_MON_EN_A</name>
                <description>Supply monitor enable for AMUXBUS_A (amuxbus_a_mon)</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SUPPLY_MON_LVL_A</name>
                <description>Supply monitor level select for AMUXBUS_A</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VRL</name>
                    <description>amuxbus_a_mon = VRL</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VRH</name>
                    <description>amuxbus_a_mon = VRH</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SUPPLY_MON_EN_B</name>
                <description>Supply monitor enable for AMUXBUS_B (amuxbus_b_mon)</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SUPPLY_MON_LVL_B</name>
                <description>Supply monitor level select for AMUXBUS_B</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VRL</name>
                    <description>amuxbus_b_mon = VRL</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VRH</name>
                    <description>amuxbus_b_mon = VRH</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REFBUF_MODE</name>
                <description>Reference mode.
The reference needs to be present when using TEMP sensor or diagnostic reference (in addition to SAR.DIAG_CTL.DIAG_EN). 
Note that setting this mode is not required for the ADC operation itself.</description>
                <bitRange>[22:21]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OFF</name>
                    <description>No reference</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ON</name>
                    <description>Reference = buffered Vbg from SRSS</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RSVD</name>
                    <description>undefined</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYPASS</name>
                    <description>Reference = unbuffered Vbg from SRSS</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DBG_FREEZE_EN</name>
                <description>Debug pause enable, 1 per ADC.
When set a high tr_debug_freeze trigger will prevent the scheduler from starting acquisitions on a new channel. Note that averaging for an already started channel will be completed.</description>
                <bitRange>[31:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>SAR_TR_IN_SEL[%s]</name>
            <description>per SAR generic input trigger select</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x43210</resetValue>
            <resetMask>0xFFFFF</resetMask>
            <fields>
              <field>
                <name>IN0_SEL</name>
                <description>Select generic trigger for SAR generic trigger input 0</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN1_SEL</name>
                <description>Select generic trigger for SAR generic trigger input 1</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN2_SEL</name>
                <description>Select generic trigger for SAR generic trigger input 2</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN3_SEL</name>
                <description>Select generic trigger for SAR generic trigger input 3</description>
                <bitRange>[15:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN4_SEL</name>
                <description>Select generic trigger for SAR generic trigger input 4</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>SAR_TR_OUT_SEL[%s]</name>
            <description>per SAR generic output trigger select</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x100</resetValue>
            <resetMask>0x3F3F</resetMask>
            <fields>
              <field>
                <name>OUT0_SEL</name>
                <description>Select SAR output trigger for generic trigger output 0
0-31: selects a tr_sar_ch_done trigger
32-63: selects a tr_sar_ch_rangvio trigger</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT1_SEL</name>
                <description>Select SAR output trigger for generic trigger output 1</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TEST_CTL</name>
            <description>Test control bits</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x137D</resetMask>
            <fields>
              <field>
                <name>TS_CAL_CUR_IN</name>
                <description>External current input switch control, for Temperature Sensor Calibration</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TS_CAL_VB_OUT</name>
                <description>Voltage Base switch control, for Temperature Sensor Calibration</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TS_CAL_VE_OUT</name>
                <description>Voltage Emitter switch control, for Temperature Sensor Calibration</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TS_CAL_DIODE_EN</name>
                <description>Diode Enable, disconnect or connect the base and collector terminal of the BJT</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TS_CAL_DIODE_PNP_EN</name>
                <description>Enable signal for PNP transistor. This transistor will be used only during calibration for accurate estimation of chip temp.
0 = Turn PNP off
1 = Configure PNP as a diode (short base and collector)</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TS_CAL_VI_SEL</name>
                <description>Select current or voltage output on 'v_temp' pin, for Temperature Sensor Calibration</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CURRENT</name>
                    <description>Current is selected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VOLTAGE</name>
                    <description>Voltage is selected</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TS_CAL_CUR_SEL</name>
                <description>Select the current going into the BJT, for Temperature Sensor Calibration</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>I_1U</name>
                    <description>Select 1 uA</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I_2U</name>
                    <description>Select 2 uA</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I_5U</name>
                    <description>Select 5 uA</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>I_10U</name>
                    <description>Select 10 uA</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TS_CAL_SPARE</name>
                <description>Spare</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
  </peripherals>
</device>